Configuration/InformationRegisters/бит_ум_ДокументыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДокументыИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриторияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДокументыИР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список текущих дел пользователя.
//
// Параметры:
//  ТекущиеДела - ТаблицаЗначений - таблица с колонками:
//   * Идентификатор           - Строка - внутренний идентификатор дела, используемый механизмом "Текущие дела".
//   * ЕстьДела                - Булево - если Истина, дело выводится в списке текущих дел пользователя.
//   * Важное                  - Булево - если Истина, дело будет выделено красным цветом.
//   * Представление           - Строка - представление дела, выводимое пользователю.
//   * Количество              - Число  - количественный показатель дела, выводится в строке заголовка дела.
//   * Форма                   - Строка - полный путь к форме, которую необходимо открыть при нажатии на гиперссылку
//                                        дела на панели "Текущие дела".
//   * ПараметрыФормы          - Структура - параметры, с которыми нужно открывать форму показателя.
//   * Владелец                - Строка, объект метаданных - строковый идентификатор дела, которое будет владельцем для текущего
//                               или объект метаданных подсистема.
//   * Подсказка               - Строка - текст подсказки.
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
    Если НЕ ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.бит_ум_ДокументыИР) Тогда
        Возврат;
	КонецЕсли;	
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	
	Если МодульТекущиеДелаСервер.ДелоОтключено("УМДокументыИР") Тогда
		Возврат
	КонецЕсли;
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор = "УМСрокДействияДокументов";
	Дело.Представление = НСтр("ru = 'Подходит срок действия документов'");
	Дело.Владелец = Метаданные.Подсистемы.УчетМигрантов;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДокументовИР.Ссылка КАК ВидДокумента,
	|	ВидыДокументовИР.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ВидыДокументовИР.СрокНапоминания КАК СрокНапоминания,
	|	ВидыДокументовИР.Наименование КАК Представление
	|ПОМЕСТИТЬ ВТВидыДокументовИР
	|ИЗ
	|	Справочник.бит_ум_ВидыДокументовИР КАК ВидыДокументовИР
	|ГДЕ
	|	ВидыДокументовИР.ПометкаУдаления = ЛОЖЬ
	|	И ВидыДокументовИР.СрокНапоминания <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыДокументовИР.ВидДокумента КАК ВидДокумента,
	|	ВидыДокументовИР.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ДокументыИР.Физлицо КАК ФизическоеЛицо,
	|	ВидыДокументовИР.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА ДокументыИР.СрокДействия <= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Важное
	|ПОМЕСТИТЬ ВТДокументыИР
	|ИЗ
	|	РегистрСведений.бит_ум_ДокументыИР.СрезПоследних(
	|			,
	|			ВидДокумента В
	|				(ВЫБРАТЬ
	|					ВидыДокументовИР.ВидДокумента
	|				ИЗ
	|					ВТВидыДокументовИР КАК ВидыДокументовИР)) КАК ДокументыИР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыДокументовИР КАК ВидыДокументовИР
	|		ПО (ВидыДокументовИР.ВидДокумента = ДокументыИР.ВидДокумента)
	|ГДЕ
	|	ДокументыИР.Архив = ЛОЖЬ 
	|	И ДокументыИР.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) >= ДОБАВИТЬКДАТЕ(ДокументыИР.СрокДействия, ДЕНЬ, -1 * ВидыДокументовИР.СрокНапоминания)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Количество = 0 Тогда
		Дело.ЕстьДела = Ложь;
		Дело.Важное = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияСотрудников =
		КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
		
	ПараметрыПолученияСотрудников.ИмяВТФизическиеЛица = "ВТДокументыИР";	
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДатаУвольнения";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников,
		"ВТСотрудникиФизическихЛиц");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыИР.ВидДокумента КАК ВидДокумента,
	|	ДокументыИР.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ДокументыИР.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СотрудникиФизическихЛиц.Сотрудник,
	|	ДокументыИР.Представление КАК Представление,
	|	ДокументыИР.Важное КАК Важное
	|ИЗ
	|	ВТДокументыИР КАК ДокументыИР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиФизическихЛиц КАК СотрудникиФизическихЛиц
	|		ПО ДокументыИР.ФизическоеЛицо = СотрудникиФизическихЛиц.ФизическоеЛицо
	|ГДЕ
	|	(СотрудникиФизическихЛиц.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НАЧАЛОПЕРИОДА(СотрудникиФизическихЛиц.ДатаУвольнения, ДЕНЬ) >= &Период)
	|ИТОГИ
	|	МАКСИМУМ(ИмяПредопределенныхДанных),
	|	КОЛИЧЕСТВО(Сотрудник),
	|	МАКСИМУМ(Представление),
	|	СУММА(Важное)
	|ПО
	|	ОБЩИЕ,
	|	ВидДокумента";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Дело.ЕстьДела = Истина;
	Дело.Важное = Выборка.Важное > 0;
	Дело.Количество = Выборка.Сотрудник;
	
	ВыборкаВидовДокументов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидовДокументов.Следующий() Цикл
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор = "УМСрокДействияДокументов"
			+ ?(ВыборкаВидовДокументов.ИмяПредопределенныхДанных <> "", ВыборкаВидовДокументов.ИмяПредопределенныхДанных,
			СтрЗаменить(ВыборкаВидовДокументов.ВидДокумента.УникальныйИдентификатор(), "-", ""));
		Дело.Представление = ВыборкаВидовДокументов.Представление;
		Дело.Владелец = "УМСрокДействияДокументов";
		Дело.ЕстьДела = Истина;
		Дело.Важное = ВыборкаВидовДокументов.Важное > 0;
		Дело.Количество = ВыборкаВидовДокументов.Сотрудник;
		Дело.Форма = "Отчет.бит_ум_ДокументыИностранныхРаботников.ФормаОбъекта";
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидДокумента", ВыборкаВидовДокументов.ВидДокумента);
		
		МассивФизическихЛиц = Новый Массив;
		ВыборкаФизическихЛиц = ВыборкаВидовДокументов.Выбрать();
		Пока ВыборкаФизическихЛиц.Следующий() Цикл
			МассивФизическихЛиц.Добавить(ВыборкаФизическихЛиц.Сотрудник);
		КонецЦикла;
		Отбор.Вставить("Сотрудник", МассивФизическихЛиц);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормы.Вставить("КлючВарианта", "Основной");
		ПараметрыФормы.Вставить("Отбор", Отбор);
		
		Дело.ПараметрыФормы = ПараметрыФормы; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
